---
kind: type
id: T:Autodesk.Revit.DB.CheckoutStatus
source: html/f6f6e300-5a37-7e44-7ee1-8dc0c016778a.htm
---
# Autodesk.Revit.DB.CheckoutStatus

Indicates the ownership status of an element

## Syntax (C#)
```csharp
public enum CheckoutStatus
```